
const list = catsGroupGenerate(999)
function nameStats(list)
{
//поиск по именам
}
nameStats(list);
/* ---------------------------------------------------------------------------- /**/
/* Задача 5                                                                     /**/
/* const list = catsGroupGenerate(999)                                          /**/
/* Написать function nameStats(list),                                           /**/
/* которая считает распределение объектов по именам, напр:                      /**/
/* {                                                                            /**/
/* Vasily: 5,                                                                   /**/
/* Murka: 10                                                                    /**/
/* }                                                                            /**/
/* ---------------------------------------------------------------------------- /**/

