//* ---------------------------------------------------------------------------- /**/
//* Задача 5                                                                     /**/
//* const list = catsGroupGenerate(999)                                          /**/
//* Написать function nameStats(list),                                           /**/
//* которая считает распределение объектов по именам, напр:                      /**/
//* {                                                                            /**/
//* Vasily: 5,                                                                   /**/
//* Murka: 10                                                                    /**/
//* }                                                                            /**/
//* ---------------------------------------------------------------------------- /**/
function catsGroupGenerate(n0)
{
    function pick(mass)
    {
        return mass[Math.floor(Math.random() * mass.length)];
    }
    function catFactory()
    {
        var mass_name = ['Айсберг','Аскольд','Астерикс'];/* ,'Аякс'     ,'Артур'    ,'Асклепий','Арес'    ,'Атос'    ,'Арамис'  ,'Август'  ,'Альбус'  ,'Алмаз'  ,
                         'Васаби' ,'Винсент','Валдис'   ,'Вирус'    ,'Ватсон'   ,'Висмут'  ,'Вермут'  ,'Витас'   ,'Витязь'  ,'Влас'    ,'Василек' ,'Вольтер',
                         'Густав' ,'Гелиос' ,'Гефест'   ,'Гусар'    ,'Гизмо'    ,'Гусляр'  ,'Гораций' ,'Ганс'    ,'Грызя'   ,'Гиннесс' ,'Гуффи'   ,'Голиаф' ,
                         'Джакс'  ,'Декстер','Диксон'   ,'Деймос'   ,'Даллас'   ,'Декарт'  ,'Джерри'  ,'Джексон' ,'Джедай'  ,'Дениска' ,'Джойстик','Дорофей',
                         'Есаул'  ,'Есенин' ,'Евсей'    ,'Енисей'   ,'Елисей'   ,'Ерофей'  ,'Ёжик'    ,'Евстахий','Елизар'  ,'Евфрат'  ,'Евклид'  ,'Енох'   ,
                         'Жозеф'  ,'Жустьен','Жгутик'   ,'Живчик'   ,'Жулик'    ,'Жусик'   ,'Жорик'   ,'Жужик'   ,'Жако'    ,'Жофрей'  ,'Жорж'    ,'Жикар'  ,
                         'Зевс'   ,'Зодиак' ,'Звездочет','Зигмунд'  ,'Задира'   ,'Забияка' ,'Завулон' ,'Зенит'   ,'Зефир'   ,'Зорро'   ,'Зидан'   ,'Захар'  ,
                         'Баксик' ,'Бакстер','Брюс'     ,'Базальт'  ,'Базилио'  ,'Базилик' ,'Боско'   ,'Бостон'  ,'Батон'   ,'Бисквит' ,'Бисер'   ,'Боцман' ,
                         'Изюмчик','Иртыш'  ,'Иствуд'   ,'Изумруд'  ,'Иосиф'    ,'Искандер','Ипполит' ,'Икар'    ,'Ивасик'  ,'Ивашка'  ,'Йогурт'  ,'Йосик'  ,
                         'Кекс'   ,'Кузьма' ,'Круассан' ,'Карабас'  ,'Космос'   ,'Конфуций','Кёртис'  ,'Коржик'  ,'Косинус' ,'Колбасыч','Каспер'  ,'Кастор' ,
                         'Ластик' ,'Лизун'  ,'Лютик'    ,'Лоскутик' ,'Люциус'   ,'Лакмус'  ,'Ляпис'   ,'Люсьен'  ,'Ланселот','Лунатик' ,'Лоуренс' ,'Лисенок',
                         'Мэйсон' ,'Маркиз' ,'Мультик'  ,'Матроскин','Марсианин','Мушкетер','Максимус','Моцарт'  ,'Муфаса'  ,'Мяут'    ,'Морсик'  ,'Маркус'  ];*/
        var mass_age = [1,2,3,5,7,9,10,13,14,15];
        var mass_gender = ['Мужской','Женский','Непонятный'];
        var mass_legsCount = ['4','3'];
        var mass_tailLength = ['1','3','5','7','9','11','13','15','25'];
    
        var CatFac = {}; /*объявление пустого котообъекта*/
        CatFac.name = pick(mass_name);                  //заполнение 
        CatFac.age = pick(mass_age);                    //котообъекта
        CatFac.gender = pick(mass_gender);              //рандомными
        CatFac.legsCount = pick(mass_legsCount);        //данными
        CatFac.tailLength  = pick(mass_tailLength);     //из БД
    
        return CatFac;
    }
    var arraCatFac = [];
    for (var i=0; i<n0; i++){
        arraCatFac[i]=catFactory();
    }
    return arraCatFac;
}
/************************************************************************************************ *//**/
function nameStats(list)
{
    console.log (" ",list);
}
var n=0; //999;
console.log (" ");
console.log ("КотоКонстантныйЛист на",n,"котов");
const list = catsGroupGenerate(n)
console.log (" --- GO ---");
nameStats(list);
console.log (" --- END ---");




console.log (" --- !! ---");


var arr = [1, -1, 2, -2, 3];

var positiveArr = arr.filter(function(number) {
  return number > 0;
});

console.log(" ", positiveArr ); // 1,2,3





console.log (" --- !!! ---");

var arr = [1, 2, 1, 4, 1]


// для каждого элемента массива запустить функцию,
// промежуточный результат передавать первым аргументом далее
var result = arr.reduce(function(sum, current) {
  return sum + current;
}, 0);

console.log(" ", result ); // 15
var map1= [];
for (var i5=0; i5<arr.length; i5++){
console.log(" ",arr.map(x => x === arr[i5]));
}
console.log (" --- !!!! ---");


list.forEach(function(element) {
    console.log(element);
  });
//console.log(map1);

var words = ['spray', 'limit', 'elite', 'exuberant', 'destruction', 'present'];

const result = words.filter(word => word.length > 6);

console.log(result);
// expected output: Array ["exuberant", "destruction", "present"]
