

function catFactory(defaults)
{
//непонятно что делать
}
/* ---------------------------------------------------------------------------- /**/
/* Задача 6                                                                     /**/
/* Модифицировать catFactory() на catFactory(defaults),                         /**/
/* где defaults - опциональный объект со значениями по умолчанию.               /**/
/* Например, вызов catFactory({gender: ‘M’}) вернет объект                      /**/
/* с произвольными значениями свойств,                                          /**/
/* за исключением gender (всегда будет равен ‘M’).                              /**/
/* В catsGroupGenerate добавить второй опциональный аргумент ‘defaults’.        /**/
/* ---------------------------------------------------------------------------- /**/
